"""
ЛАБИРИНТ - ПОИСК В ГЛУБИНУ
Автор программы - Павел Вадимович Добряк
Для свободного распространения среди студентов ИРИТ-РтФ.
В Интернете в открытом доступе не публиковать!
"""

"""
Поиск в глубину с бэктрекингом.
Метафора: человек заходит в лабиринт и идет по нему, рисуя стрелки
в направлении выхода. Если зайдет в тупик, возвращается по своим стрелкам,
оглядываясь по сторонам. Если видит проходы, где еще не бывал,
заходит в эти проходы.
"""

L=[[9,9,9,9,9,9,0,9,9,9],
   [9,0,9,9,9,0,0,0,0,9],
   [9,0,9,0,0,0,9,9,0,9],
   [9,0,0,0,0,9,0,0,0,9],
   [9,9,0,9,0,9,0,9,0,9],
   [9,9,0,9,9,9,0,9,0,9],
   [9,0,0,0,0,9,9,9,9,9],
   [9,0,9,9,0,9,9,0,0,9],
   [9,0,0,9,0,9,9,0,0,9],
   [9,9,0,9,9,9,9,9,9,9]]

def show(L):
    for i in range(len(L)):
        s=""
        for j in range(len(L)):
            if L[i][j]==0:
                s=s+"0"
            elif L[i][j]==9:
                s=s+"#"
            elif L[i][j]==1:
                s=s+">"
            elif L[i][j]==2:
                s=s+"^"
            elif L[i][j]==3:
                s=s+"<"
            elif L[i][j]==4:
                s=s+"v"
        print(s)

def backtrack(L):
    #Основная функция блуждания по лабиринту
    def bt(L, i0, j0):
        i=i0
        j=j0
        for k in range(len(L)*len(L)):
            #Оглядываемся по сторонам в поисках прохода:
            if j + 1 < len(L) and L[i][j + 1] == 0:
                  L[i][j + 1] = 3
                  j = j + 1
            elif i - 1 >= 0 and L[i - 1][j] == 0:
                  L[i - 1][j] = 4
                  i = i - 1
            elif j - 1 >= 0 and L[i][j - 1] == 0:
                  L[i][j - 1] = 1
                  j = j - 1
            elif i + 1 < len(L) and L[i + 1][j] == 0:
                  L[i + 1][j] = 2
                  i = i + 1
            #Бэктрекинг
            else:
                if i==i0 and j==j0: #вернулись откыда пришли
                    break
                #возвращаемся назад по нашим стрелкам:
                if L[i][j] == 1:
                    j = j + 1
                elif L[i][j] == 2:
                    i = i - 1
                elif L[i][j] == 3:
                    j = j - 1
                elif L[i][j] == 4:
                    i = i + 1
    # Поиск входов - просматриваем края лабиринта        
    for i in range(len(L)):
        if L[0][i] == 0:
            L[0][i] = 2
            bt(L, 0, i)
        if L[-1][i] == 0:
            L[-1][i] = 4
            bt(L, len(L)-1, i)
        if L[i][0] == 0:
            L[i][0] = 3
            bt(L, i, 0)
        if L[i][-1] == 0:
            L[i][-1] = 1
            bt(L, i, len(L)-1)

backtrack(L)
show(L)

"""
ПОИСК В ГЛУБИНУ, СТЕК

упростить возвращение назад можно с помощью стека.
Вместо того, чтобы идти по стрелкам, будем запоминать координаты
клеток, по которым шли в стеке (в качестве стека используем список).
При возврате будем извлекать координаты с конца списка.
Когда стек кончится, это значит, что мы вернулись ко входу
"""
"""
L=[[9,9,9,9,9,9,0,9,9,9],
   [9,0,9,9,9,0,0,0,0,9],
   [9,0,9,0,0,0,9,9,0,9],
   [9,0,0,0,0,9,0,0,0,9],
   [9,9,0,9,0,9,0,9,0,9],
   [9,9,0,9,9,9,0,9,0,9],
   [9,0,0,0,0,9,9,9,9,9],
   [9,0,9,9,0,9,9,0,0,9],
   [9,0,0,9,0,9,9,0,0,9],
   [9,9,0,9,9,9,9,9,9,9]]

def show(L):
    for i in range(len(L)):
        s=""
        for j in range(len(L)):
            if L[i][j]==0:
                s=s+"0"
            elif L[i][j]==9:
                s=s+"#"
            elif L[i][j]==1:
                s=s+">"
            elif L[i][j]==2:
                s=s+"^"
            elif L[i][j]==3:
                s=s+"<"
            elif L[i][j]==4:
                s=s+"v"
        print(s)

def backtrack(L):
    #Основная функция блуждания по лабиринту
    def bt(L, i0, j0):
        i=i0
        j=j0
        path=[(i0,j0)] #стек для запоминания пути
        for k in range(len(L)*len(L)):
            #Оглядываемся по сторонам в поисках прохода:
            if j + 1 < len(L) and L[i][j + 1] == 0:
                  L[i][j + 1] = 3
                  j = j + 1
                  path.append((i,j))
            elif i - 1 >= 0 and L[i - 1][j] == 0:
                  L[i - 1][j] = 4
                  i = i - 1
                  path.append((i,j))
            elif j - 1 >= 0 and L[i][j - 1] == 0:
                  L[i][j - 1] = 1
                  j = j - 1
                  path.append((i,j))
            elif i + 1 < len(L) and L[i + 1][j] == 0:
                  L[i + 1][j] = 2
                  i = i + 1
                  path.append((i,j))
            else:
                #Бэктрекинг - возвращаемся назад по нашим стрелкам:
                i,j = path.pop()
                print(i,j)
                if i==i0 and j==j0: #вернулись к выходу
                    break
                
    # Поиск входов - просматриваем края лабиринта        
    for i in range(len(L)):
        if L[0][i] == 0:
            L[0][i] = 2
            bt(L, 0, i)
        if L[-1][i] == 0:
            L[-1][i] = 4
            bt(L, len(L)-1, i)
        if L[i][0] == 0:
            L[i][0] = 3
            bt(L, i, 0)
        if L[i][-1] == 0:
            L[i][-1] = 1
            bt(L, i, len(L)-1)

backtrack(L)
show(L)
"""
"""

ЛАБИРИНТ - ПОИСК В ГЛУБИНУ РЕКУРСИЕЙ


В этом случае возвращение назад не нужно. Заход в тупик -
это случай, когда рекурсивная функция не вызывается.
"""
"""
L=[[9,9,9,9,9,9,0,9,9,9],
   [9,0,9,9,9,0,0,0,0,9],
   [9,0,9,0,0,0,9,9,0,9],
   [9,0,0,0,0,9,0,0,0,9],
   [9,9,0,9,0,9,0,9,0,9],
   [9,9,0,9,9,9,0,9,0,9],
   [9,0,0,0,0,9,9,9,9,9],
   [9,0,9,9,0,9,9,0,0,9],
   [9,0,0,9,0,9,9,0,0,9],
   [9,9,0,9,9,9,9,9,9,9]]

def show(L):
    for i in range(len(L)):
        s=""
        for j in range(len(L)):
            if L[i][j]==0:
                s=s+"0"
            elif L[i][j]==9:
                s=s+"#"
            elif L[i][j]==1:
                s=s+">"
            elif L[i][j]==2:
                s=s+"^"
            elif L[i][j]==3:
                s=s+"<"
            elif L[i][j]==4:
                s=s+"v"
        print(s)

def DFS(L):
    def bt(L, i, j):
        if j+1 < len(L) and L[i][j+1] == 0:
            L[i][j+1] = 3
            bt(L, i, j+1)
        if i-1 >= 0 and L[i-1][j] == 0:
            L[i-1][j] = 4
            bt(L, i-1, j)
        if j-1 >= 0 and L[i][j-1] == 0:
            L[i][j-1] = 1
            bt(L, i, j-1)
        if i+1 < len(L) and L[i+1][j] == 0:
            L[i+1][j] = 2
            bt(L, i+1, j)
    for i in range(len(L)):
        if L[0][i] == 0:
            L[0][i] = 2
            bt(L, 0, i)
        if L[-1][i] == 0:
            L[-1][i] = 4
            bt(L, len(L)-1, i)
        if L[i][0] == 0:
            L[i][0] = 3
            bt(L, i, 0)
        if L[i][-1] == 0:
            L[i][-1] = 1
            bt(L, i, len(L)-1)

DFS(L)
show(L)
"""
